import re

""" ========================================== Задача ================================================
как найти майл в строке
==================================================================================================="""

email = """
CoreyMSchafer@gmail.com
corey.schafer@university.edu
corey-321-schafer@my-work.net
"""

# [a-zA-Z0-9_.+-] - означает какие символы мы ищем
# []+ - знак + означает, что должен быть хотябы 1 символ

pattern = re.compile(r"[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+")

matches = pattern.finditer(email)
# print(matches) - вызывет объект, который надо итерировать

for match in matches:
    print(match)

""" ========================================== Задача ================================================
у нас уже есть email адреса в списке и нам надо отфильтровать только те адреса, которые заканчиваются н gmail.com
==================================================================================================="""

emails = ["user1@gmail.com", "user2@yahoo.com", "user3@gmail.com", "user4@hotmail.com", "user5@mail.com", ""]


# фильтрация адресов заканчивающая на gmail.com
gmail_emails = []
for email in emails:
    if re.search(r"\b\w+@gmail\.com\b", email):
        gmail_emails.append(email)

print(gmail_emails)

# \b - граница между словом и не словом
# \w+ - говорит что у нас как минимум 1 символ из набора букв, цифр и некоторых спецсимволов
# \b - вторая часть, говорит о том что эта строка заканчивается на выбранном нами слове .com




