"""
6. Самостоятельная практика
"""
import re

""" ================================================== Задача 1 ================================================
Вам дан текст сообщения:

text = '''
Visit my website at https://www.example.com
or you can check out https://www.someotherexample.com
'''
Напишите и примените регулярное выражение, чтобы получить список всех URL-адресов.
============================================================================================================="""


text_1 = '''
Visit my website at https://www.example.com
or you can check out https://www.someotherexample.com
'''

pattern = re.compile(r"https?://(www\.)?(\w+)(\.\w+)")

matched = pattern.finditer(text_1)

urls = [match.group() for match in matched]         # вывод список
print(urls)                                         # ['https://www.example.com', 'https://www.someotherexample.com']




# for match in matched:
#     print(match)

""" вывод
<re.Match object; span=(21, 44), match='https://www.example.com'>
<re.Match object; span=(66, 98), match='https://www.someotherexample.com'>
"""




""" ================================================== Задача 2 ================================================
У вас есть текст сообщения:

text = 'Позвоните мне по номеру 555-123-4567 или 555-987-6543'
Напишите и примените регулярное выражение, чтобы извлечь номера телефонов, т. е. 
найти любую последовательность из 10 цифр, которая может представлять собой номер телефона.
=========================================================================================================="""

text_2= 'Позвоните мне по номеру 555-123-4567 или 555-987-6543'

pattern_telephone = re.compile(r'\d{3}-\d{3}-\d{4}')
phone_numbers = pattern_telephone.findall(text_2)
print(phone_numbers)





""" ================================================== Задача 3 ================================================
Вам дана строка:

text = 'Цвет неба - синий.'
Напишите и примените регулярное выражение, чтобы заменить все вхождения слова синий на слово blue
=========================================================================================================="""

text_3 = 'Цвет неба - синий.'

new_text = re.sub(r"синий", "blue", text_3)
print(new_text)

